#pragma once
#ifndef NOTE_OPERATING_SYSTEM
#define NOTE_OPERATING_SYSTEM

/* 第一章 操作系统概论
	@1.1 操作系统概观
		#操作系统的作用与功能
			* 操作系统是用户与计算机硬件之间的接口
			* 为用户提供了虚拟计算机（virtual machine）
			* 是计算机系统的资源管理者：
				** 处理机管理：
					*** 处理中断事件：硬件只能发现中断事件，捕捉它并产生中断信号，但不能处理。
					*** 处理器调度 对处理器的管理和调度归结为对进程和线程的管理和调度：
							1）进程控制和管理
							2）进程同步和互斥
							3）进程通信
							4）进程死锁
							5）线程控制和管理
				** 储存管理：1）存储分配 2）存储共享 3）地址转换和存储保护
				** 设备管理
				** 文件管理
				** 网络与通信管理
				** 用户接口：程序接口和操作接口
		 * 操作系统的主要特征：
			1）并发性（concurrence）
			2）共享性（sharing）
			3）异步性（asynchronism）
			4）虚拟性（virtual）
		# 操作系统的形成和发展
*/

/* 第二章


*/

#endif